# CurrentVersion Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadSwapOutInfo..::..CurrentVersion Property
ReloadSwapOutInfo Class See Also
---
New version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int CurrentVersion { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentVersion As Integer
	Get
```

Visual C++
---
```text
public:
property int CurrentVersion {
	int get ();
}
```

# See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace